performance-tests/result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 10 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  01.0s/30s

running (0m02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  02.0s/30s

running (0m03.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  03.0s/30s

running (0m04.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  04.0s/30s

running (0m05.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  05.0s/30s

running (0m06.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  06.0s/30s

running (0m07.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  07.0s/30s

running (0m08.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  08.0s/30s

running (0m09.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  09.0s/30s

running (0m10.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  10.0s/30s

running (0m11.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  11.0s/30s

running (0m12.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  12.0s/30s

running (0m13.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  13.0s/30s

running (0m14.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  14.0s/30s

running (0m15.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  15.0s/30s

running (0m16.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  16.0s/30s

running (0m17.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  17.0s/30s

running (0m18.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  18.0s/30s

running (0m19.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  19.0s/30s

running (0m20.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  20.0s/30s

running (0m21.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  21.0s/30s

running (0m22.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  22.0s/30s

running (0m23.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  23.0s/30s

running (0m24.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  24.0s/30s

running (0m25.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  25.0s/30s

running (0m26.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  26.0s/30s

running (0m27.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  27.0s/30s

running (0m28.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  28.0s/30s

running (0m29.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  29.0s/30s

running (0m30.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 300     9.973428/s
    checks_succeeded...: 100.00% 300 out of 300
    checks_failed......: 0.00%   0 out of 300

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=2.11ms min=344.4µs med=1.89ms max=9.54ms p(90)=2.74ms p(95)=3.04ms
      { expected_response:true }...: avg=2.11ms min=344.4µs med=1.89ms max=9.54ms p(90)=2.74ms p(95)=3.04ms
    http_req_failed................: 0.00%  0 out of 300
    http_reqs......................: 300    9.973428/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s      med=1s     max=1.01s  p(90)=1s     p(95)=1s    
    iterations.....................: 300    9.973428/s
    vus............................: 10     min=10       max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 123 kB 4.1 kB/s
    data_sent......................: 24 kB  788 B/s



running (0m30.1s), 00/10 VUs, 300 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  30s

========================================
BASELINE TEST - 10 VUs - 30 seconds
========================================

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 10 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  01.0s/30s

running (0m02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  02.0s/30s

running (0m03.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  03.0s/30s

running (0m04.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  04.0s/30s

running (0m05.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  05.0s/30s

running (0m06.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  06.0s/30s

running (0m07.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  07.0s/30s

running (0m08.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  08.0s/30s

running (0m09.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  09.0s/30s

running (0m10.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  10.0s/30s

running (0m11.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  11.0s/30s

running (0m12.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  12.0s/30s

running (0m13.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  13.0s/30s

running (0m14.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  14.0s/30s

running (0m15.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  15.0s/30s

running (0m16.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  16.0s/30s

running (0m17.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  17.0s/30s

running (0m18.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  18.0s/30s

running (0m19.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  19.0s/30s

running (0m20.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  20.0s/30s

running (0m21.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  21.0s/30s

running (0m22.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  22.0s/30s

running (0m23.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  23.0s/30s

running (0m24.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  24.0s/30s

running (0m25.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  25.0s/30s

running (0m26.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  26.0s/30s

running (0m27.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  27.0s/30s

running (0m28.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  28.0s/30s

running (0m29.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  29.0s/30s

running (0m30.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 300     9.976938/s
    checks_succeeded...: 100.00% 300 out of 300
    checks_failed......: 0.00%   0 out of 300

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=1.56ms min=239.39µs med=1.03ms max=15.32ms p(90)=2.48ms p(95)=2.96ms
      { expected_response:true }...: avg=1.56ms min=239.39µs med=1.03ms max=15.32ms p(90)=2.48ms p(95)=2.96ms
    http_req_failed................: 0.00%  0 out of 300
    http_reqs......................: 300    9.976938/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s       med=1s     max=1.01s   p(90)=1s     p(95)=1s    
    iterations.....................: 300    9.976938/s
    vus............................: 10     min=10       max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 123 kB 4.1 kB/s
    data_sent......................: 24 kB  788 B/s



running (0m30.1s), 00/10 VUs, 300 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  30s

========================================
BASELINE TEST - 50 VUs - 30 seconds
========================================

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  01.0s/30s

running (0m02.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  02.0s/30s

running (0m03.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  03.0s/30s

running (0m04.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  04.0s/30s

running (0m05.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  05.0s/30s

running (0m06.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  06.0s/30s

running (0m07.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  07.0s/30s

running (0m08.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  08.0s/30s

running (0m09.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  09.0s/30s

running (0m10.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  10.0s/30s

running (0m11.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  11.0s/30s

running (0m12.0s), 50/50 VUs, 550 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  12.0s/30s

running (0m13.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  13.0s/30s

running (0m14.0s), 50/50 VUs, 650 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  14.0s/30s

running (0m15.0s), 50/50 VUs, 700 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  15.0s/30s

running (0m16.0s), 50/50 VUs, 750 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  16.0s/30s

running (0m17.0s), 50/50 VUs, 800 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  17.0s/30s

running (0m18.0s), 50/50 VUs, 850 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  18.0s/30s

running (0m19.0s), 50/50 VUs, 900 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  19.0s/30s

running (0m20.0s), 50/50 VUs, 950 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  20.0s/30s

running (0m21.0s), 50/50 VUs, 1000 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  21.0s/30s

running (0m22.0s), 50/50 VUs, 1050 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  22.0s/30s

running (0m23.0s), 50/50 VUs, 1100 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  23.0s/30s

running (0m24.0s), 50/50 VUs, 1150 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  24.0s/30s

running (0m25.0s), 50/50 VUs, 1200 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  25.0s/30s

running (0m26.0s), 50/50 VUs, 1250 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  26.0s/30s

running (0m27.0s), 50/50 VUs, 1300 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  27.0s/30s

running (0m28.0s), 50/50 VUs, 1350 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  28.0s/30s

running (0m29.0s), 50/50 VUs, 1400 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  29.0s/30s

running (0m30.0s), 50/50 VUs, 1450 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1500    49.87763/s
    checks_succeeded...: 100.00% 1500 out of 1500
    checks_failed......: 0.00%   0 out of 1500

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=2.02ms min=146.53µs med=1.21ms max=16.92ms p(90)=4.19ms p(95)=5.89ms
      { expected_response:true }...: avg=2.02ms min=146.53µs med=1.21ms max=16.92ms p(90)=4.19ms p(95)=5.89ms
    http_req_failed................: 0.00%  0 out of 1500
    http_reqs......................: 1500   49.87763/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s       med=1s     max=1.01s   p(90)=1s     p(95)=1s    
    iterations.....................: 1500   49.87763/s
    vus............................: 50     min=50        max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 614 kB 20 kB/s
    data_sent......................: 119 kB 3.9 kB/s



running (0m30.1s), 00/50 VUs, 1500 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s

========================================
BASELINE TEST - 100 VUs - 30 seconds
========================================

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 100 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  01.0s/30s

running (0m02.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  02.0s/30s

running (0m03.0s), 100/100 VUs, 200 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  03.0s/30s

running (0m04.0s), 100/100 VUs, 300 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  04.0s/30s

running (0m05.0s), 100/100 VUs, 400 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  05.0s/30s

running (0m06.0s), 100/100 VUs, 500 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  06.0s/30s

running (0m07.0s), 100/100 VUs, 600 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  07.0s/30s

running (0m08.0s), 100/100 VUs, 700 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  08.0s/30s

running (0m09.0s), 100/100 VUs, 800 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  09.0s/30s

running (0m10.0s), 100/100 VUs, 900 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  10.0s/30s

running (0m11.0s), 100/100 VUs, 1000 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  11.0s/30s

running (0m12.0s), 100/100 VUs, 1100 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  12.0s/30s

running (0m13.0s), 100/100 VUs, 1200 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  13.0s/30s

running (0m14.0s), 100/100 VUs, 1300 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  14.0s/30s

running (0m15.0s), 100/100 VUs, 1400 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  15.0s/30s

running (0m16.0s), 100/100 VUs, 1500 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  16.0s/30s

running (0m17.0s), 100/100 VUs, 1600 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  17.0s/30s

running (0m18.0s), 100/100 VUs, 1700 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  18.0s/30s

running (0m19.0s), 100/100 VUs, 1800 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  19.0s/30s

running (0m20.0s), 100/100 VUs, 1900 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  20.0s/30s

running (0m21.0s), 100/100 VUs, 2000 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  21.0s/30s

running (0m22.0s), 100/100 VUs, 2100 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  22.0s/30s

running (0m23.0s), 100/100 VUs, 2200 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  23.0s/30s

running (0m24.0s), 100/100 VUs, 2300 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  24.0s/30s

running (0m25.0s), 100/100 VUs, 2400 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  25.0s/30s

running (0m26.0s), 100/100 VUs, 2500 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  26.0s/30s

running (0m27.0s), 100/100 VUs, 2600 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  27.0s/30s

running (0m28.0s), 100/100 VUs, 2700 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  28.0s/30s

running (0m29.0s), 100/100 VUs, 2800 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  29.0s/30s

running (0m30.0s), 100/100 VUs, 2900 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 3000    99.715214/s
    checks_succeeded...: 100.00% 3000 out of 3000
    checks_failed......: 0.00%   0 out of 3000

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=2.29ms min=156.15µs med=1.39ms max=24.76ms p(90)=4.72ms p(95)=6.78ms
      { expected_response:true }...: avg=2.29ms min=156.15µs med=1.39ms max=24.76ms p(90)=4.72ms p(95)=6.78ms
    http_req_failed................: 0.00%  0 out of 3000
    http_reqs......................: 3000   99.715214/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s       med=1s     max=1.02s   p(90)=1s     p(95)=1s    
    iterations.....................: 3000   99.715214/s
    vus............................: 100    min=100       max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 1.2 MB 41 kB/s
    data_sent......................: 237 kB 7.9 kB/s



running (0m30.1s), 000/100 VUs, 3000 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  30s

========================================
BASELINE TEST - 500 VUs - 30 seconds
========================================

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 500 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 500 VUs  01.0s/30s

running (0m02.0s), 500/500 VUs, 500 complete and 0 interrupted iterations
default   [   7% ] 500 VUs  02.0s/30s

running (0m03.0s), 500/500 VUs, 1000 complete and 0 interrupted iterations
default   [  10% ] 500 VUs  03.0s/30s

running (0m04.0s), 500/500 VUs, 1500 complete and 0 interrupted iterations
default   [  13% ] 500 VUs  04.0s/30s

running (0m05.0s), 500/500 VUs, 2000 complete and 0 interrupted iterations
default   [  17% ] 500 VUs  05.0s/30s

running (0m06.0s), 500/500 VUs, 2500 complete and 0 interrupted iterations
default   [  20% ] 500 VUs  06.0s/30s

running (0m07.0s), 500/500 VUs, 3000 complete and 0 interrupted iterations
default   [  23% ] 500 VUs  07.0s/30s

running (0m08.0s), 500/500 VUs, 3500 complete and 0 interrupted iterations
default   [  27% ] 500 VUs  08.0s/30s

running (0m09.0s), 500/500 VUs, 4000 complete and 0 interrupted iterations
default   [  30% ] 500 VUs  09.0s/30s

running (0m10.0s), 500/500 VUs, 4500 complete and 0 interrupted iterations
default   [  33% ] 500 VUs  10.0s/30s

running (0m11.0s), 500/500 VUs, 5000 complete and 0 interrupted iterations
default   [  37% ] 500 VUs  11.0s/30s

running (0m12.0s), 500/500 VUs, 5500 complete and 0 interrupted iterations
default   [  40% ] 500 VUs  12.0s/30s

running (0m13.0s), 500/500 VUs, 6000 complete and 0 interrupted iterations
default   [  43% ] 500 VUs  13.0s/30s

running (0m14.0s), 500/500 VUs, 6500 complete and 0 interrupted iterations
default   [  47% ] 500 VUs  14.0s/30s

running (0m15.0s), 500/500 VUs, 7000 complete and 0 interrupted iterations
default   [  50% ] 500 VUs  15.0s/30s

running (0m16.0s), 500/500 VUs, 7500 complete and 0 interrupted iterations
default   [  53% ] 500 VUs  16.0s/30s

running (0m17.0s), 500/500 VUs, 8000 complete and 0 interrupted iterations
default   [  57% ] 500 VUs  17.0s/30s

running (0m18.0s), 500/500 VUs, 8500 complete and 0 interrupted iterations
default   [  60% ] 500 VUs  18.0s/30s

running (0m19.0s), 500/500 VUs, 9000 complete and 0 interrupted iterations
default   [  63% ] 500 VUs  19.0s/30s

running (0m20.0s), 500/500 VUs, 9500 complete and 0 interrupted iterations
default   [  67% ] 500 VUs  20.0s/30s

running (0m21.0s), 500/500 VUs, 10000 complete and 0 interrupted iterations
default   [  70% ] 500 VUs  21.0s/30s

running (0m22.0s), 500/500 VUs, 10500 complete and 0 interrupted iterations
default   [  73% ] 500 VUs  22.0s/30s

running (0m23.0s), 500/500 VUs, 11000 complete and 0 interrupted iterations
default   [  77% ] 500 VUs  23.0s/30s

running (0m24.0s), 500/500 VUs, 11500 complete and 0 interrupted iterations
default   [  80% ] 500 VUs  24.0s/30s

running (0m25.0s), 500/500 VUs, 12000 complete and 0 interrupted iterations
default   [  83% ] 500 VUs  25.0s/30s

running (0m26.0s), 500/500 VUs, 12500 complete and 0 interrupted iterations
default   [  87% ] 500 VUs  26.0s/30s

running (0m27.0s), 500/500 VUs, 13000 complete and 0 interrupted iterations
default   [  90% ] 500 VUs  27.0s/30s

running (0m28.0s), 500/500 VUs, 13500 complete and 0 interrupted iterations
default   [  93% ] 500 VUs  28.0s/30s

running (0m29.0s), 500/500 VUs, 14000 complete and 0 interrupted iterations
default   [  97% ] 500 VUs  29.0s/30s

running (0m30.0s), 500/500 VUs, 14500 complete and 0 interrupted iterations
default   [ 100% ] 500 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 15000   497.196548/s
    checks_succeeded...: 100.00% 15000 out of 15000
    checks_failed......: 0.00%   0 out of 15000

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=3.65ms min=124.01µs med=1.01ms max=99.9ms p(90)=4.66ms p(95)=14.58ms
      { expected_response:true }...: avg=3.65ms min=124.01µs med=1.01ms max=99.9ms p(90)=4.66ms p(95)=14.58ms
    http_req_failed................: 0.00%  0 out of 15000
    http_reqs......................: 15000  497.196548/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s       med=1s     max=1.1s   p(90)=1s     p(95)=1.01s  
    iterations.....................: 15000  497.196548/s
    vus............................: 500    min=500        max=500
    vus_max........................: 500    min=500        max=500

    NETWORK
    data_received..................: 6.1 MB 203 kB/s
    data_sent......................: 1.2 MB 39 kB/s



running (0m30.2s), 000/500 VUs, 15000 complete and 0 interrupted iterations
default ✓ [ 100% ] 500 VUs  30s

========================================
BASELINE TEST - 1000 VUs - 30 seconds
========================================

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 1000 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  01.0s/30s

running (0m02.0s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default   [   7% ] 1000 VUs  02.0s/30s

running (0m02.9s), 1000/1000 VUs, 2000 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  02.9s/30s

running (0m04.0s), 1000/1000 VUs, 3000 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  04.0s/30s

running (0m04.9s), 1000/1000 VUs, 4000 complete and 0 interrupted iterations
default   [  17% ] 1000 VUs  05.0s/30s

running (0m06.0s), 1000/1000 VUs, 5000 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  06.0s/30s

running (0m06.9s), 1000/1000 VUs, 6000 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  06.9s/30s

running (0m08.0s), 1000/1000 VUs, 7000 complete and 0 interrupted iterations
default   [  27% ] 1000 VUs  08.0s/30s

running (0m09.0s), 1000/1000 VUs, 8000 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  09.0s/30s

running (0m10.0s), 1000/1000 VUs, 9000 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  10.0s/30s

running (0m11.0s), 1000/1000 VUs, 10000 complete and 0 interrupted iterations
default   [  37% ] 1000 VUs  11.0s/30s

running (0m12.0s), 1000/1000 VUs, 11000 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  12.0s/30s

running (0m12.9s), 1000/1000 VUs, 12000 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  12.9s/30s

running (0m14.0s), 1000/1000 VUs, 13000 complete and 0 interrupted iterations
default   [  47% ] 1000 VUs  14.0s/30s

running (0m14.9s), 1000/1000 VUs, 14000 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  14.9s/30s

running (0m16.0s), 1000/1000 VUs, 15000 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  16.0s/30s

running (0m16.9s), 1000/1000 VUs, 16000 complete and 0 interrupted iterations
default   [  56% ] 1000 VUs  16.9s/30s

running (0m18.0s), 1000/1000 VUs, 17000 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  18.0s/30s

running (0m19.0s), 1000/1000 VUs, 18000 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  19.0s/30s

running (0m20.0s), 1000/1000 VUs, 19000 complete and 0 interrupted iterations
default   [  67% ] 1000 VUs  20.0s/30s

running (0m20.9s), 1000/1000 VUs, 20000 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  20.9s/30s

running (0m21.9s), 1000/1000 VUs, 21000 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  21.9s/30s

running (0m23.0s), 1000/1000 VUs, 22000 complete and 0 interrupted iterations
default   [  77% ] 1000 VUs  23.0s/30s

running (0m24.0s), 1000/1000 VUs, 23000 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  24.0s/30s

running (0m25.0s), 1000/1000 VUs, 24000 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  25.0s/30s

running (0m26.0s), 1000/1000 VUs, 25000 complete and 0 interrupted iterations
default   [  87% ] 1000 VUs  26.0s/30s

running (0m27.0s), 1000/1000 VUs, 26000 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  27.0s/30s

running (0m27.9s), 1000/1000 VUs, 27000 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  27.9s/30s

running (0m29.0s), 1000/1000 VUs, 28000 complete and 0 interrupted iterations
default   [  97% ] 1000 VUs  29.0s/30s

running (0m30.0s), 1000/1000 VUs, 29000 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 30000   991.480718/s
    checks_succeeded...: 100.00% 30000 out of 30000
    checks_failed......: 0.00%   0 out of 30000

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=5.07ms min=122.94µs med=1.11ms max=130.27ms p(90)=7.65ms p(95)=22.74ms
      { expected_response:true }...: avg=5.07ms min=122.94µs med=1.11ms max=130.27ms p(90)=7.65ms p(95)=22.74ms
    http_req_failed................: 0.00%  0 out of 30000
    http_reqs......................: 30000  991.480718/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s       med=1s     max=1.15s    p(90)=1s     p(95)=1.02s  
    iterations.....................: 30000  991.480718/s
    vus............................: 1000   min=1000       max=1000
    vus_max........................: 1000   min=1000       max=1000

    NETWORK
    data_received..................: 12 MB  406 kB/s
    data_sent......................: 2.4 MB 78 kB/s



running (0m30.3s), 0000/1000 VUs, 30000 complete and 0 interrupted iterations
default ✓ [ 100% ] 1000 VUs  30s